{
"origin":["#gardening#", "#love#"],
"gardening":["Misjudging sunlight is a common pitfall when you're first learning to garden. Pay attention to how sunlight plays through your yard before choosing a spot for your garden. Most edible plants, including many vegetables, herbs, and fruits, need at least 6 hours of sun in order to thrive.", "Starting a garden is just like real estate it's all about location. Place your garden in a part of your yard where you'll see it regularly. That way, you'll be much more likely to spend time in it.", "One of the best gardening tips you'll ever get is to plan your new garden near a water source. Make sure you can run a hose to your garden site, so you don't have to lug water to it each time your plants get thirsty. The best way to tell if plants need watering is to push a finger an inch down into the soil. If it's dry, it's time to water.", "When starting a garden, one of the top pieces of advice is to invest in soil that is nutrient-rich and well-drained. Achieve this just-right blend by mixing 3 inches of Miracle-Gro® All Purpose Garden Soil into the top 6 to 8 inches of existing soil if you're planning to plant in the ground. If you're planting in a raised bed, use Miracle-Gro® Raised Bed Soil, which is the perfect weight and texture for raised bed growing.", "When space is at a premium, look to containers. You can grow many plants in pots, including vegetables, herbs, flowers, fruit trees, berries, and shrubs. When gardening in containers, use a pot that's large enough for the plant it's hosting, and fill it with Miracle-Gro® Moisture Control® Potting Mix. Not only is it specially formulated to help plants in pots thrive, but it also helps protect against over- and under-watering.", "It's important to select plants that match your growing conditions. This means putting sun-loving plants into a sunny spot, choosing heat-tolerant plants in warm climates, and giving ground-gobbling vines like pumpkins and melons ample elbow room (or a trellis to climb). Do your homework and pick varieties that will grow well where you live and in the space you have. And to get a step up on success when growing veggies and herbs, start with vigorous young plants from Bonnie Plants® instead of trying to grow from seed.", "Knowing your hardiness zone can help you choose the best plants. Simply put, it describes the coldest place a plant can grow. The higher the zone number, the warmer the climate. So if a plant is hardy to zone 4 and you garden in zone 5, that plant will survive in your yard. If, however, you're in zone 3, it's too cold to grow that particular plant.", "Planting too early (or late) in the season can spell disaster for your garden. You need to know the last average spring frost date for your area so you don't accidentally kill plants by putting them out prematurely. It's also good to know your first average fall frost date so that you get your plants harvested or moved indoors before late-season cold damages them.", "Apply a layer of mulch that's 2 to 3 inches deep around each plant. This will help reduce weeds by blocking out the sun, and reduce moisture loss through evaporation, so you have to water less. For a polished look, put down a layer of Scotts® bagged mulch. Or, you can put down straw, shredded leaves, pine straw, or some other locally available material.", "We've already talked about the importance of starting with great soil, but that soil works best in concert with regular boosts of high-quality nutrition for your plants. In other words, amazing soil + top-notch plant food = super garden success! So, a month after planting, begin feeding your garden with plant food like Miracle-Gro® Water Soluble All Purpose Plant Food. Be sure to follow label directions.", "Not sure when to prune? Prune spring-flowering shrubs, such as lilacs, and large-flower climbing roses immediately after the blooms fade. They set their flower buds in autumn on last year's growth. If you prune them in fall or winter, you remove next spring's flower buds.", "Apply only composted, rotted manure that has cured for at least six months to your soil. Fresh manure is too high in nitrogen and can burn plants; it may also contain pathogens or parasites. Manure from pigs, dogs, and cats should never be used in gardens or compost piles because they may contain parasites that can infect humans.", "Perennials generally need three years after you plant them to achieve their mature size. Remember the adage that they sleep, creep, and leap each year respectively.", "Deadheading is a good practice for perennials and annuals. Because the goal of annual plants is to flower, set seed, and die, removing the old blooms tells annual plants to produce more flowers. Removing spent flowers also encourages plants to use their energy to grow stronger leaves and roots instead of seed production. Avoid deadheading plants grown especially for their decorative fruits or pods, such as money plant.", "The best approaches to controlling weeds in the garden are hand-weeding and hoeing. Avoid deep hoeing or cultivating that can bring weed seeds to the soil's surface so they germinate. Weed early and often so weeds don't go to seed. Use mulch to smother and prevent annual weeds.", "Hostas don't need to be divided unless you want to rejuvenate an old plant or increase the numbers you have, or because you simply prefer the look of single plants. The best times to divide your hostas are in the spring as the new shoots begin appearing but before the leaves unfurl, or in the fall at least four weeks before your soil freezes solid.", "Don't clean up everything in your garden in fall. Leave ornamental grasses for beauty and the seed heads of perennials such as coneflowers to feed the birds. Avoid cutting back marginally hardy perennials, such as garden mums, to increase their chances of surviving a harsh winter.", "Plant spring-blooming bulbs, such as tulips, fritillarias, ornamental alliums, and crocuses, in the fall before the ground freezes. In general, place the bulb in a hole that's two to three times the depth of the bulb. While most hardy bulbs you only need to plant once, and they'll keep coming up year after year, note that hybrid tulips are an exception to this rule. It's best to pull them up when they are done blooming and replant new tulip bulbs each fall, or choose species tulips that become perennial.", "Fertilizer is not the answer to growing the best plants; soil quality is. Add organic amendments such as compost and well-aged manure to your soil. The best soil structure is crumbly, easy to dig, accepts water easily, and is loose enough to provide oxygen for plant roots. If you choose to use fertilizer, use an organic one to add nitrogen, phosphate, and potash.", "When transplanting container-grown perennials, dig a hole a that's twice as wide as the soil ball of the plant to aid with root establishment. Make sure the plant sits at the same depth in the hole as it did in the container. Use the same soil you dug out of the hole to fill in around your new plant instead of using bagged soil.", "Don't send your fall leaves away! Chop them up and use them as compost ingredients. Pulverized leaves can be left to nourish the lawn. After several hard freezes, when plants have gone completely dormant, you also can use 3-6 inches of shredded leaves as mulch over tender perennials to keep them dormant over winter. Remove the mulch in spring.", "Native species of plants are often better adapted to growing in your region than plants from other places in the world. They also are better for local pollinators that evolved with them. If you want to grow plants to support pollinators, avoid newer cultivars with double flowers because all the extra petals make it harder for insects to reach the nectar and pollen."],
"love":["Hmm sounds like when #lovestories#", "That reminds me of that time #lovestories#", "#loveadvice#"],
"lovestories":["Dashrath Manjhi, a destitute person in Gehlour, a small village in India lost his wife when he could not take her to the doctor after she fell off of a cliff. With strong determination, and often being called a ‘psychopath’, Dashrath took 22 years breaking stones in the mountains to pave a 400 feet long and 30 feet wide road that connected the village to the nearby city. His only motive was to provide people of his village with access to medical services so that nobody would lose a loved one like he did.", "A 77-year-old Indian man named Faizul Hasan Quadri vowed to build his ‘monument of love’ for his wife Tajammuli Begum in Bulandshahr district in Uttar Pradesh, India. Faizul married Begum when she was just 14 and he taught her to read and write in Urdu. The couple had no child and his wife always worried if she would be forgotten after her death. Quadri promised to build her a mausoleum and that she’d be remembered for ages.'We were together for more than 58 years, and love grows with time. Now that she is gone, she is always there in my thoughts', he says. Tajammuli died of cancer in 2011.", "Chadil Deffy and Sarinya Kamsook had plans to get married soon after Deffy completed his studies. But his life was devastated after he learned the news of Sarinya’s death in an accident even before the two finalized a date to tie the knot. But death could not beat his love. Deffy married his deceased girlfriend in a combination funeral and wedding ceremony where he placed a ring on Sarinya’s hand, his girlfriend of 10 years and kissed her in a ceremony in Thailand’s Surin province.", "Gerda Weissmann, a Polish-born American writer was forced to March by the Nazis for months along with 4000 other Jewish women. She lost 65 family members during the time of war and only 120 of those women in the march were alive and abandoned in a factory where they lived without proper food for days. She was one day shy of her 21st birthday, wearing rags and not bathed in three years when Kurt Klein, a Lieutenant in the United States Army force found her and rescued. The couple was engaged in September 1945 and married shortly after.", "Bonnie and Clyde, two lovers who disobeyed laws in the United States during the Great Depression robbed a lot of banks, small stores and gas stations while also killing nine police officers and several civilians. The two met on January 5, 1930 at Clarence Clay’s house at 105 Herbert Street and became close friends in no time before confessing their love for each other. The two ran a gang and were known to be involved in a lot of notorious crime during the Public Enemy Era (1931-1935). The two remained loyal to each other during their life and even at the time of the violent death with gunshots they predicted as inevitable in 1934.", "Shah Hussain, a Punjabi Sufi poet also called as the Sufi saint fell in love with a Brahmin boy called 'Madho Lal'. Though gay marriage was not legal anywhere in the world before this century, the two shared a mutual feeling for each other and dared to confess their love in Pakistan, a Muslim state when they lived during their 1960s. The two are often referred to as a single person with the composite name of 'Madho Lal Hussain.' Thousands of people visit the shrine and the tomb during the 'Mela Chiraghan' where the two rest together in silence."],
"loveadvice":["Just don’t talk about your ex", "One rule I had with my last girlfriend, that I’m proud we stuck to, was ‘Don’t go to bed angry.’", "’Not treating her right,’ in my experience that is usually ‘your not pampering me and buying me things’ if that’s the case dump her, as for the other guy sounds like she wanted to be with him (she’s going to lie about it regardless). Therapy is a huge waste of money especially over something so small, I’d say move on.", "You should find someone better for yourself.", "Show them who's the boss. Don't let them push you around!", "Demand that your partner is romantic!", "Stay quiet. Don't make it worse.", "Just remind them that what they earn isn't enough.", "Look at me and learn." ]
}